# -*- coding: utf-8 -*-

from board.models import Sublocality

subloc_detect = (
    (u'Центр', (
        u'советская',
        u'кузнечн',
        u'потебни',
        u'рымарск',
        u'нетеченск',
    )),
    (u'Нагорный', (
        u'нагорн',
        u'госпром',
        u'держпром',
        u'м.университет',
        u'пушкинск',
        u'арх.бекетова',
        u'архбекетова',
        u'архитекторабекетова',
        u'м.бекетова',
        u'метробекетова',
        u'метропушкинск',
        u'пр.рпавды',
        u'прправды',
        u'сумск',
        u'данилевского',
        u'тринклера',
        u'чернышевского',
        u'ул.артема',
    )),
    (u'Центральный рынок', (
        u'центральныйрын',
        u'центральногорын',
        u'центр.рын',
        u'карламаркса',
    )),
    (u'Левада', (
        u'левада',
        u'мпргагарина',
        u'м.пр.гагарина',
        u'м.гагарина',
        u'мгагарина',
        u'метрогагарина',
        u'портал',
    )),
    (u'пл. Руднева', (
        u'руднева',
    )),
    (u'Москалевка', (
        u'москалевк',
    )),
    (u'Заиковка', (
        u'основянск',
    )),
    (u'Новожаново', (
        u'новожаново',
        u'заводшевченк',
        u'заводашевченк',
        u'з-дшевченк',
        u'з-дашевченк',
    )),
    (u'Диканевка', (
        u'диканевк',
    )),
    (u'Дудковка', (
        u'дудковк',
    )),
    (u'Новая Бавария', (
        u'бавари',
        u'пр,.ильича',
        u'прильича',
        u'тимирязева',
    )),
    (u'Минутка', (
        u'минутк',
    )),
    (u'Липовая Роща', (
        u'липоваярощ',
        u'липовойрощ',
    )),
    (u'Ледное', (
        u'ледно',
    )),
    (u'Филипповка', (
        u'филипповк',
        u'филиповк',
    )),
    (u'Гуты', (
        u'гуты',
        u'гутах',
    )),
    (u'пос. Силикатный', (
        u'силикатн',
    )),
    (u'ЮЖД', (
        u'южд',
        u'южныйвокзал',
        u'южноговокзал',
    )),
    (u'Панасовка', (
        u'панасовк',
    )),
    (u'Гончаровка', (
        u'гончаровк',
        u'старыйцирк',
        u'старогоцирк',
    )),
    (u'Карповка', (
        u'карповк',
    )),
    (u'Холодная Гора', (
        u'холгор',
        u'хол.гор',
        u'х.гор',
        u'холоднаягор',
        u'холоднойгор',
        u'володарского',
    )),
    (u'Лысая Гора', (
        u'лысойгор',
        u'лысаягор',
        u'л.гор',
    )),
    (u'Гиевка', (
        u'гиевк',
    )),
    (u'Лагерное', (
        u'лагерно',
    )),
    (u'пос. Ленина', (
        u'пос.ленина',
    )),
    (u'Красный Октябрь', (
        u'красныйоктябрь',
    )),
    (u'Залютино', (
        u'залютино',
        u'золочевская',
    )),
    (u'Новоселовка', (
        u'новоселовк',
    )),
    (u'Григоровка', (
        u'григоровк',
    )),
    (u'Качановка', (
        u'качановк',
    )),
    (u'Верещаковка', (
        u'верещаковк',
    )),
    (u'Одесская', (
        u'одесск',
        u'одеск',
        u'джунгли',
        u'к-р"салют"',
        u'к-рсалют',
        u'к-расалют',
        u'кинотеатр«салют»',
        u'кинотеатрсалют',
    )),
    (u'Основа', (
        u'основа',
        u'основе',
        u'южнопроектн',
    )),
    (u'пос. Герцена', (
        u'ул.ньютона',
    )),
    (u'Мерефянка', (
        u'мерефянско',
    )),
    (u'Аэропорт', (
        u'аэропорт',
    )),
    (u'Федорцы', (
        u'федорц',
    )),
    (u'Жихарь', (
        u'жихар',
    )),
    (u'пл. Восстания', (
        u'восстания',
        u'востания',
        u'спортивн',
        u'конныйрын',
        u'конногорын',
        u'ун-гхарьков',
    )),
    (u'Красный Луч', (
        u'метрозаводмалышева',
        u'мзаводмалышева',
        u'ммалышева',
    )),
    (u'Балашовка', (
        u'балашовк',
    )),
    (u'Парк Артема', (
        u'паркартема',
        u'паркаартема',
        u'посартема',
    )),
    (u'Селекционная', (
        u'м.жукова',
        u'метрожукова',
        u'метроим.жукова',
        u'м.маршалажукова',
        u'советскойармии',
        u'сов.армии',
    )),
    (u'Новые Дома', (
        u'комунальныйрын',
        u'коммунальныйрын',
        u'комунальногорын',
        u'коммунальногорын',
        u'коммунальныйр-к',
        u'новыедома',
        u'новыхдома',
        u'н.дома',
    )),
    (u'Ново-Западный', (
        u'ново-западн',
        u'новозападн',
    )),
    (u'Горбани', (
        u'горбани',
    )),
    (u'Павленки', (
        u'павленки',
    )),
    (u'ХТЗ', (
        u'хтз',
        u'масельского',
        u'метропролетарск',
        u'м.пролетарск',
        u'пр.фрунзе',
        u'тракторныйзавод',
        u'улицемира',
    )),
    (u'пос. Фрунзе', (
        u'посфрунзе',
        u'поселокфрунзе',
    )),
    (u'Заики', (
        u'заики',
    )),
    (u'Затишье', (
        u'затишье',
    )),
    (u'Восточный', (
        u'восточный',
        u'мохначанск',
        u'махначанск',
        u'шариковая',
    )),
    (u'Горизонт', (
        u'горизонт',
    )),
    (u'пос. Докучаева', (
        u'улдокучаева',
    )),
    (u'Сабурова Дача', (
        u'сабуровадача',
    )),
    (u'Рашкина Дача', (
        u'рашкинадача',
    )),
    (u'Журавлевка', (
        u'журавлевк',
        u'журавлёвк',
        u'м.киевск',
    )),
    (u'Тюринка', (
        u'тюринк',
    )),
    (u'Шевченки', (
        u'шевченки',
    )),
    (u'Лазьковка', (
        u'лазьковка',
    )),
    (u'Халтурина', (
        u'халтурина',
    )),
    (u'Старая Салтовка', (
        u'стараясалт',
        u'старойсалт',
        u'краснодарская',
    )),
    (u'Салтовка', (
        u'салтовк',
        u'м.студенческая',
        u'метростуденческая',
        u'м.ак.павлова',
        u'метроак.барабашов',
        u'героевтруда',
        u'гер.труда',
        u'г.труда',
        u'уборевича',
        u'океан',
        u'негони',
        u'тркукраина',
        u'трк"украина"',
        u'пр-ттракторостр',
        u'янтарн',
        u'601м',
        u'602м',
        u'салтовск',
    )),
    (u'Северная Салтовка', (
        u'севернаясалт',
        u'севернойсалт',
        u'севсалт',
        u'сев.салт',
        u'ссалт',
        u'с.салт',
    )),
    (u'Большая Даниловка', (
        u'б.даниловк',
        u'даниловк',
        u'даниловк',
    )),
    (u'Немышля', (
        u'немышл',
    )),
    (u'Петренки', (
        u'петренк',
    )),
    (u'Кулиничи', (
        u'кулинич',
    )),
    (u'пос. Кирова', (
        u'пос.кирова',
    )),
    (u'Сокольники', (
        u'сокольник',
    )),
    (u'Померки', (
        u'померки',
    )),
    (u'пос. Жуковского', (
        u'жуковск',
        u'проскуры',
    )),
    (u'Шишковка', (
        u'шишковк',
    )),
    (u'Роял Клаб', (
        u'роялклаб',
    )),
    (u'Парк Хаус', (
        u'паркхаус',
        u'паркхауз',
    )),
    (u'Пятихатки', (
        u'пятихатк',
    )),
    (u'Шатиловка', (
        u'шатиловк',
        u'научн',
        u'бакулина',
    )),
    (u'Сосновая горка', (
        u'сосноваягорк',
        u'сосновойгорк',
        u'с.горк',
        u'космическ',
    )),
    (u'Павловка', (
        u'павловк',
        u'ул.лопанск',
        u'залесск',
        u'клочковск',
    )),
    (u'Ивановка', (
        u'ивановк',
        u'котлова',
    )),
    (u'Сортировка', (
        u'сортировк',
    )),
    (u'Павлово поле', (
        u'павловомполе',
        u'павловополе',
        u'п.поле',
        u'23августа',
        u'м.бот.сад',
        u'метроботаническийсад',
        u'улбалакирева',
    )),
    (u'Алексеевка', (
        u'алексеевк',
        u'алексеевск',
        u'пр.победы',
        u'прпобеды',
        u'пр.людвига',
    )),
    (u'Малая Даниловка', (
        u'мал.даниловк',
        u'малаяданиловк',
        u'малойданиловк',
    )),
    (u'Флоринка', (
        u'флоринк',
    )),
    (u'Родичи', (
        u'родич',
    )),
    (u'Черкасская Лозовая', (
        u'ч.лозов',
        u'черкасскаялозов',
        u'черкасскойлозов',
    )),
    (u'Лесное', (
        u'лесное',
        u'лесном',
    )),
    (u'Циркуны', (
        u'циркун',
    )),
    (u'Коммунист', (
        u'коммунист',
    )),
    (u'Логачевка', (
        u'логачевк',
    )),
    (u'Молчаны', (
        u'молчан',
    )),
    (u'Коммунар', (
        u'коммунар',
    )),
    (u'Безлюдовка', (
        u'безлюдвк',
    )),
    (u'Радгоспное', (
        u'радгоспно',
    )),
    (u'Бабаи', (
        u'бабаи',
        u'бабаях',
    )),
    (u'Покотиловка', (
        u'покотиловк',
    )),
    (u'Песочин', (
        u'песочин',
    )),
    (u'Подворки', (
        u'подворки',
        u'подворках',
    )),
    (u'Сиряки', (
        u'сиряки',
        u'сиряках',
    )),
    (u'Солоницевка', (
        u'солоницевк',
    )),
    (u'Балаклейский р-н', (
        u'балакле',
        u'балак.р-н',
    )),
    (u'Барвенковский р-н', (
        u'барвенков',
    )),
    (u'Близнюковский р-н', (
        u'близнюк',
    )),
    (u'Богодуховский р-н', (
        u'богодух',
    )),
    (u'Боровской р-н', (
        u'боровая',
        u'боровск',
        u'боров.р-н',
    )),
    (u'Валковский р-н', (
        u'валки',
        u'валковскийр-н',
    )),
    (u'Великобурлукский р-н', (
        u'великобурлукск',
    )),
    (u'Волчанский р-н', (
        u'волчанск',
        u'волчан.р-н',
        u'ст.салтов',
        u'старыйсалтов',
        u'старомсалтов',
        u'рубежн',
    )),
    (u'Двуречанский р-н', (
        u'двуреч.р-н',
        u'двуречанск',
    )),
    (u'Дергачевский р-н', (
        u'дергачи',
        u'дергачах',
        u'дергачевский',
        u'русскаялозов',
        u'русскойлозов',
    )),
    (u'Зачепиловский р-н', (
        u'зачепиловк',
        u'зачепиловский',
        u'зачепиловском',
    )),
    (u'Змиевской р-н', (
        u'змиев',
    )),
    (u'Золочевский р-н', (
        u'золочев',
    )),
    (u'Изюмский р-н', (
        u'изюм',
    )),
    (u'Кегичевский р-н', (
        u'кегичевск',
    )),
    (u'Коломакский р-н', (
        u'коломак',
    )),
    (u'Красноградский р-н', (
        u'красноград',
        u'красног.р-н',
    )),
    (u'Краснокутский р-н', (
        u'краснокутск',
        u'краснок.р-н',
    )),
    (u'Купянский р-н', (
        u'купянск',
        u'купян.р-н',
    )),
    (u'Лозовской р-н', (
        u'лозов',
    )),
    (u'Нововодолажский р-н', (
        u'новаяводолага',
        u'новойводолаги',
        u'нововодолажск',
    )),
    (u'Первомайский р-н', (
        u'первомайск',
        u'первом.р-н',
    )),
    (u'Печенежский р-н', (
        u'печенеги',
        u'печенежск',
    )),
    (u'Сахновщинский р-н', (
        u'сахновщин',
    )),
    (u'Харьковский р-н', (
        u'харьк.р-н',
        u'васищево',
        u'мереф',
        u'песочин',
        u'ольховк',
        u'люботин',
        u'южный',
        u'посвысок',
        u'хорошево',
        u'березовк',
        u'глубокое',
        u'лукъянц',
        u'русскиетишк',
        u'русскихтишк',
        u'черкасскиетишк',
        u'черкасскихтишк',
    )),
    (u'Чугуевский р-н', (
        u'чугуев',
    )),
    (u'Шевченковский р-н', (
        u'шевченковск',
        u'шевченково',
    )),
    (u'Центр', (
        u'центр,',
        u'втихомцентре',
        u'вцентре',
        u'хатоб',
    )),
    (u'Нет района', (
    )),
)

def import_data():
    for subloc, mark_list in subloc_detect:
        subloc_obj = Sublocality.objects.get(name=subloc)
        for mark in mark_list:
            subloc_obj.sublocalitydetect_set.get_or_create(text=mark, city_id=20)
    # извращение с Роганью из-за одинакового имени села и района
    rogan = Sublocality.objects.filter(name=u'Рогань')
    rogan_list = (
        u'роган',
        u'военвед',              
        u'ул.тархова',              
    )
    for rog in rogan_list:
        rogan[0].sublocalitydetect_set.get_or_create(text=rog, city_id=20)